class WeatherAnchor
  WEATHER_URI = URI("http://api.openweathermap.org/data/2.5/weather?q=Skopje,mk")
  CODES = [
     [200, "има грмотевици со малку дожд."], [201, "има грмотевици со дожд."],
     [202, "има грмотевици со многу дожд."], [210, "има малку грмотевици."],
     [211, "има грмотевици."], [212, "има многу грмотевици."],
     [221, "ИМА ГРМОТЕВИЦИ, МНОГУ ГРМОТЕВИЦИ!"], [230, "грми и малку роси."],
     [231, "грмотевици и росење."], [232, "грмотевици со ситен дожд."],
     [300, "малку роси."], [301, "роси."], [302, "бааги роси."],
     [310, "почнува да врне."], [311, "почнува да врне."], [312, "врне дожд."],
     [313, "врне дожд."], [314, "врне дожд."], [321, "здраво врне!"],
     [500, "си врне."], [501, "убаво врне."], [502, "бајаги врне!"], [503, "многу врне."],
     [504, "многу врне, ќе не поплави."], [511, "врне замрзнат дожд."], [520, "малку врне."],
     [521, "врне дожд!"], [522, "мноoooгу врне дожд!"], [531, "многу врне, МНОГУ!"],
     [600, "ВРНЕ СНЕГ ЛУЃЕНЦА!"], [601, "врне снег!"], [602, "многу врне снег..."],
     [611, "има лапавица."], [612, "истура снег."], [615, "врне малку измешан снег со дожд."],
     [616, "врне снег со дожд."], [620, "врне снег."], [621, "врне снег."],
     [622, "многу врне снег, многу!!!"], [701, "е магловито."], [711, "е зачадено."],
     [721, "е бааги магловито."], [731, "е лом, прашина насекаде!"],
     [741, "многу магла има."], [751, "има песочна бура!"], [761, "има прашина насекаде."],
     [762, "има ВУЛКАНСКА ПЕПЕЛ, сите по дома!"], [771, "има меќава."],
     [781, "има торнадо, сите у подрум!"], [800, 'небото е чисто.'],
     [801, 'има чат пат по некој облак.'], [802, 'има одвоени облаци.'],
     [803, 'има облаци.'], [804, 'облачно e!'], [900, 'има торнадо!'],
     [901, 'има тропска бура!'], [902, 'има ураган!'], [903, 'е ладно!'],
     [904, 'е топло.'], [905, 'е ветровито.'], [906, 'врне град!'], [951, 'е мирно.'],
     [950, 'заоѓа сонцето...'], [952, 'има слаб ветар.'], [953, 'има слаб ветар.'],
     [954, 'е ветровито.'], [955, 'дува свеж ветар.'], [956, 'дува силен ветар.'],
     [957, 'дува многу силен ветар.'], [958, 'има невреме!'], [959, 'има силно невреме!'],
     [960, 'има бура.'], [961, 'има силна бура.'], [962, 'има ураган!'],
    ]


  class << self
    def update!
      new.present!
    end
  end

  def initialize
    @json = JSON.parse(Net::HTTP.get(WEATHER_URI))
  end

  def present!
    Tweeter.tweet_it!(speech)
  end

  def speech
    description = "Шо има веза дали е ладно или топло, марш сите надвор на #СтудентскиМарш !"
    return description
  end

  private
  def wind_description
    BeaufortScale.describe(wind_speed)
  end

  def temperature
    kelvin = @json["main"]["temp"]
    (kelvin - 273.15).round(0)
  end

  def wind_speed
    @json["wind"]["speed"]
  end

  def id_code
    @json["weather"][0]["id"]
  end

  def weather_status
    code = CODES.detect do |code, desc|
      code == id_code
    end
    description = "Во моментов #{code.last}"
  end

  def tweet_description
    case temperature
    when -100..-20
      "#{temperature} степени. Ладно нек си ибе мајката!"
    when -19..-10
      "#{temperature} степени, грч ладно."
    when -9..0
      "Брррр... ладно! Температурата е #{temperature} степени."
    when 1..10
      "Свежo e, со температура од #{temperature} степени."
    when 10..15
      "Малку е свежо. Температурата е #{temperature} степени."
    when 16..20
      "Пријатно е, со температура од #{temperature} степени."
    when 21..25
      if wind_speed < 3.0
        if Time.now.hour > 21 || Time.now.hour < 7
          "#{temperature} степени, времево си грми за стискавац на некоја клупа!"
        else
          "#{temperature} степени, времево си грми за на кафе!"
        end
      else
        "#{temperature} степени, топ!"
      end
    when 26..35
      "Топлоooo... (#{temperature} степени)"
    when 36..42
      "Мнооогу топло! Фаќа накај 40ка..."
    when 42..100
      "ПЕКОЛ!"
    end

  end
end
